///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ПланФикс
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВнешняяОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	СлужебныеДанные = ВнешняяОбработкаОбъект.ПолучитьСлужебныеДанные();
	СтруктуруМетаданныхДляОбмена = ВнешняяОбработкаОбъект.ПолучитьСтруктуруМетаданныхДляОбмена(СлужебныеДанные);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьСлужебнуюИнформацию(Команда)
	ВывестиРезультатВСроку(СлужебныеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСтруктуруМетаданных(Команда)
	ВывестиРезультатВСроку(СтруктуруМетаданныхДляОбмена);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанные(Команда)
	ПолучитьДанныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеНаСервере()
	ВнешняяОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Для каждого Данные Из СтруктуруМетаданныхДляОбмена Цикл
		РезультатВыполненияЗапроса = ВнешняяОбработкаОбъект.ПолучитьДанныеДляОбмена(Данные.Значение);
		
		Построитель = Новый ПостроительОтчета;
		Построитель.ИсточникДанных  = Новый ОписаниеИсточникаДанных(РезультатВыполненияЗапроса);
		Построитель.Вывести(РезультатЗапроса);
		
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВывестиРезультатВСроку(СтруктураДанных)
	
	Для каждого Данные Из СтруктураДанных  Цикл
		СтрокаСДанными = Данные.Ключ + ": " + Данные.Значение + Символы.ПС + СтрокаСДанными;
	КонецЦикла;
	
	Результат = "";
	Результат = СтрокаСДанными;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьJSONНаСервере()
	ВнешняяОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	JSON = "";
	ЧастьJSON = "";
	Для каждого  Данные Из СтруктуруМетаданныхДляОбмена Цикл
		РезультатВыполненияЗапроса = ВнешняяОбработкаОбъект.ПолучитьДанныеДляОбмена(Данные.Значение);
		ЧастьJSON = ЧастьJSON + Символы.ПС + ВнешняяОбработкаОбъект.СофрмироватьJSON(РезультатВыполненияЗапроса.Выгрузить(), Данные.Ключ); 
	КонецЦикла; 
	JSON = ЧастьJSON;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьJSON(Команда)
	СформироватьJSONНаСервере();
КонецПроцедуры

#КонецОбласти
